[
    {
      "id": 1,
      "title": "Warner remains in Australia's Ashes plans, insists Andrew McDonald",
      "content": "Australia head coach Andrew McDonald has insisted that David Warner remains in his plans for the forthcoming Ashes series. The 36-year-old has endured a lean run in the longest format of the game, recording just one 50-plus score in his last 15 visits to the crease, which incidentally was a double century at the last Boxing Day Test against South Africa"
    },
    {
      "id": 2,
      "title": "I've had confidence in Conway like Faf had in me: Ruturaj Gaikwad",
      "content": "Despite losing out on bringing Faf du Plessis back to the CSK fold, the four-time champions have been shrewd enough to find another potent opening partner for Ruturaj Gaikwad this season. On a day that he and Devon Conway took their tally of fifty-run partnerships past that of Gaikwad and Du Plessis, the Indian opener reckoned he has had a role reversal in this alliance."
    },

    {
      "id": 3,
      "title": "MS Dhoni helps calm uncapped CSK substitute after misfield, same fielder delivers clutch run out moments later",
      "content": "Gujarat Titans were chasing 173 for victory on a typical Chepauk wicket last night (May 23). They have established themselves as the masters of the chase since their IPL debut last year, but faltered in front of the Chennai’s spinners on a slow pitch last night."
    },

    {
      "id": 4,
      "title": "Chennai Super Kings’ sixth success story with NRR is not luck, it is clarity of thought",
      "content": "CSK have been the most consistent team in the IPL, reaching the playoffs 12 times (out of 14) and contesting the final on nine occasions. More often than not, they have relied on MS Dhoni’s astute leadership and his ability to extract every ounce of performance from his team."
    },

    {
      "id": 5,
      "title": "Today’s IPL 2023 match, LSG vs MI live score: Updated scorecard, XIs, toss, stats and match prediction",
      "content": "Lucknow have used Krishnappa Gowtham and Amit Mishra alternately based on matchups and conditions. They played Gowtham in the last game, but may be tempted to play Mishra tonight. Mishra has a good record in Chennai, and has troubled Mumbai captain Rohit Sharma a lot in the IPL."
    },

    {
      "id": 6,
      "title": "‘That doesn’t make sense’ – Play bizarrely stalled for several minutes as CSK cop time penalty to let Pathirana re-bowl",
      "content": "The incident happened before the start of the 16th over of Gujarat Titans’ chase. At that point, the match was all but sewn up, with Gujarat 102-6 and still needing 71 runs from the final 30 ball of their innings. CSK had posted 172-7 batting first"
    },

    {
      "id": 7,
      "title": "Nathan Sowter goes full circle to end up at Durham, another home away from home",
      "content": "NICK FRIEND – INTERVIEW: Born and raised in Australia before making a career for himself at Middlesex, Sowter will make his first appearance for Durham this week since moving permanently over the winter to the county of his mother's family"
    },

    {
      "id": 8,
      "title": "Jadeja finally gets his Chepauk (yel)love",
      "content": "This was Ravindra Jadeja after winning the Player-of-the-Match award against Delhi Capitals at Chepauk earlier this month. His work often gets overshadowed, and others profit from it. Like the Chepauk DJ, who cued up Mannipaaya (Will you forgive me?) from actor Silambarasan TR's movie Vinnaithandi Varuvaayaa in CSK's next game at Chepauk, against Kolkata Knight Riders, when Jadeja walked out to bat. Chepauk thought it was clever and laughed."
    },

    {
      "id": 9,
      "title": "How Chennai Super Kings filled the Dwayne Bravo-sized hole in death overs",
      "content": "Dwayne Bravo usually came to life at the death during his ten-season IPL stint as a player with Chennai Super Kings. Is it really a surprise then that the team he is now coaching has the joint-most wickets in the death overs in IPL 2023?"
    },

    {
      "id": 10,
      "title": "Hardik rues Titans' 'basic errors' against Super Kings",
      "content": "Gujarat Titans' captain Hardik Pandya thinks basic errors and a few soft balls cost his side the playoff against Chennai Super Kings. Having won the toss, Hardik had opted to bowl and Super Kings went on to score 172. Titans struggled throughout the chase and were eventually bowled out for 157, losing by 15 runs - the exact number of extra runs Hardik thought they conceded."
    }, 

    {
      "id": 11,
      "title": "Malinga on Pathirana: 'I somehow want to make this guy even better than me'",
      "content": "Lasith Malinga, now a bowling consultant with Rajasthan Royals, has been watching Chennai Super Kings' games with particular interest. Matheesha Pathirana, CSK's death-overs specialist, not only bowls with the same, unusual round-arm action with which Malinga dominated the IPL for many years, but is also in a sense a protege."
    },

    {
      "id": 12,
      "title": "IPL 2023 orange cap: Faf du Plessis, purple cap: Mohammed Shami",
      "content": "The playoffs have begun but Royal Challengers Bangalore captain Faf du Plessis remains the leading run-scorer, with 730 runs at a strike rate of 153.68. Shubman Gill, who scored 42 in Gujarat Titans' loss against Chennai Super Kings in the first Qualifier, is in second place with 722 runs"
    },

    {
      "id": 13,
      "title": "Noor Ahmad: How Gujarat Titans found and honed Rashid Khan",
      "content": "Devdutt Padikkal held his tentative and futile forward defence pose for an extra second, trying to wrap his head around what had just happened as Gujarat Titans celebrated in the background. Rashid Khan had already wreaked havoc on the sluggish Jaipur surface before the 18-year-old Noor Ahmad arrived, planted a seed of doubt in Padikkal's mind about which way the ball was going to turn and knocked back the left-hander's off-stump. Rajasthan Royals were six down in the 12th over, and somewhere in the Titans dugout assistant coach Aashish Kapoor could chuckle with pride."
    },

    {
      "id": 14,
      "title": "'I play the way I think' - Rinku Singh reflects on a special season",
      "content": "He has been the toast of IPL 2023 but ask him about it and the answer would trace back to how KKR weren't able to qualify. Rinku Singh, though, remains the story of the ongoing season and sounds most grounded, despite all the accolades that followed him."
    },

    {
      "id": 15,
      "title": "Shardul Thakur and Akshar Patel amongst the first batch of Indian WTC final squad to leave for UK- Report",
      "content": "The first group of the Indian squad for the upcoming ICC World Test Championship (WTC 2023) final consisting of about 20 members, mostly support staff, including Rahul Dravid and players Shardul Thakur and Akshar Patel flew out to the UK on May 23, 2023."
    },

    {
      "id": 16,
      "title": "'Just two young boys from Baroda who never gave up' - Hardik Pandya's heartwarming photo with brother Krunal wins internet",
      "content": "India cricketers Hardik Pandya and Krunal Pandya are the first brother duo to compete as captains in the history of the Indian Premier League (IPL). The all-rounders led their respective franchises, Gujarat Titans (GT) and Lucknow Super Giants (LSG) in the 51st match of the ongoing IPL at the Narendra Modi Stadium in Ahmedabad on Sunday, May 7. Notably, the match was won by the team led by younger brother Hardik."
    },

    {
      "id": 17,
      "title": "IPL 2023: Best playing XI from league stage",
      "content": "This year’s IPL was a roller-coaster for the teams as many teams displayed top-notch performances and gave their 100% to keep their teams on top. As the IPL league stage concluded, let us look at some key players who were the most consistent for their teams and proved to be a vital part of the tournament."
    },

    {
      "id": 18,
      "title": "Twitter Reactions: New Zealand down Pakistan despite Iftikhar Ahmed's fighting knock in Karachi",
      "content": "Pakistan went down fighting in the fifth and final ODI of the series against New Zealand in Karachi as the visitors managed to avoid the embarrassment of a whitewash against the Asian side. Although the Kiwis won the game comfortably in the end after posting a solid total of 299 runs, the match wasn't short of drama by any means."
    },

    {
      "id": 19,
      "title": "Cricket World Player of the Week - Shubman Gill",
      "content": "Shubman Gill is the top run-scorer for the Titans with 680 runs at a strike rate of 152. He has struck 22 sixes and 67 fours. It was courtesy of his back-to-back hundreds that Gujarat Titans finished the group stage at the top spot with 10 wins and 4 losses from their 14 matches."
    },

    {
      "id": 20,
      "title": "Delhi Capitals: the too-little-too-late bloomers",
      "content": "Delhi Capitals - the star side of the last few seasons. A developing team that had only recently made the final (2020), ended up at the top of the points table (2021) and fell just short of the playoffs (2022). This was supposed to be their season, and after the auction, it was one of the more complete sides in the tournament. And then, it started to fall apart. Rishabh Pant, their captain and star batsman, got into a near-fatal car crash, and was ruled out of the IPL."
    }
 

  ]
  